[
  {
    "title": "Uncontrollably Fond",
    "synopsis": "When Shin Joon-Young (Kim Woo-Bin) and No Eul (Bae Suzy) were children, they were separated and became heartbroken. As adults they meet again. Shin Joon-Young is now a top actor and singer. He is intelligent and attractive. No Eul is the PD of documentaries. She values money over justice and kisses up to those with more power than her.",
    "imageUrl": "https://asianwiki.com/images/f/f5/Uncontrollably_Fond-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=2BhKaOi5OJ0",
    "releasedYear": 2016,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "The Heirs",
    "synopsis": "'The Heirs' depicts the friendships, rivalries and love lives of young, rich heirs led by Kim Tan (Lee Min-Ho) and a girl named Cha Eun-Sang (Park Shin-Hye). Unlike the others, Cha Eun-Sang is considered ordinary and comes from a poor background.",
    "imageUrl": "https://asianwiki.com/images/4/48/The_Heirs_-_Korean_Drama-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=Y0WSF5ikpvU",
    "releasedYear": 2013,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "I'm Not a Robot",
    "synopsis": "Min-Kyu (Yoo Seung-Ho) is the largest shareholder of a finance company. He is handsome and intelligent, but he lives in seclusion due to his allergy of people. Meanwhile, Ji-A (Chae Soo-Bin) is an aspiring entrepreneur and works as a personal shopper. She receives a phone call from her ex-boyfriend Baek-Gyun (Uhm Ki-Joon). Her ex-boyfriend is a world renown developer of android robots. His latest creation is the android Aji 3, which he built with the same physical appearance as Ji-A, but an accident has broken Aji 3. Making matters worse, he has received an order for Aji 3 from Min-Kyu with the promise of more investment money if he's satisfied. Being in such a predicament, Baek-Gyun offers money to Ji-A if she will go to Min-Kyu's home and pretend to be Aji 3. Ji-A is in need of money and accepts the offer.",
    "imageUrl": "https://asianwiki.com/images/e/e9/I%27m_Not_a_Robot-P1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=6gVPM3dGVoU",
    "releasedYear": 2018,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Twenty Five Twenty One",
    "synopsis": "'Twenty-Five, Twenty-One' tells a love story between Na Hee-Do (Kim Tae-Ri) and Back Yi-Jin (Nam Joo-Hyuk). Na Hee-Do is a member of her high school fencing team. Due to the South Korean financial crisis, the high school fencing team gets disbanded. Getting through all the difficulties, she becomes a member of the sabre fencing national team. The South Korean financial crisis also causes Back Yi-Jin’s father's business to go bankrupt. This leads to a life change for Back Yi-Jin, from living the life of a wealthy person to a poor person. While studying, he works part-time jobs like delivery newspapers. Later, he becomes a sports reporter for a broadcasting network.",
    "imageUrl": "https://asianwiki.com/images/1/1c/Twenty-Five_Twenty-One-p2.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=gYp4cKumTwU",
    "releasedYear": 2022,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Pinocchio",
    "synopsis": "As a child, Ha-Myeong (Lee Jong-Suk) grew up in a family with his firefighter father, mother and older brother. Ha-Myeong and his older brother (Yoon Gyun-Sang) both possess higher than normal intellect and are proud of their father. A fire at a waste facility though destroys his family. His mother dies a short time later and Ha-Myeong ends up being scooped out of the ocean by an unknown man (Byun Hee-Bong). The man that pulls Ha-Myeong out of the ocean is the grandfather of In-Ha (Park Shin-Hye). In-Ha's grandfather believes Ha-Myeong is his eldest son Dal-Po, who died 30 years ago. Ha-Myeong is then adopted by In-Ha's grandfather and his name is changed to Dal-Po. In-Ha and Dal-Po now live together as uncle and niece, although they are in the same age range. In-Ha has a Pinocchio Syndrome. Whenever she lies she gets the hiccups. In-Ha and Dal-Po get along well until Dal-Po learns that In-Ha's mother (Jin Kyung) is the reporter that covered the waste facility fire that destroyed his family. Dal-Po tries to distance himself from In-Ha, but he also develops feelings for her.",
    "imageUrl": "https://asianwiki.com/images/0/0f/Pinocchio_%28Korean_Drama%29-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=Ji8VBCtuhVI",
    "releasedYear": 2014,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "My Love From The Star",
    "synopsis": "Do Min-Joon is an alien who landed on Earth 400 years ago during the Joseon Dynasty period. Do Min-Joon possesses a near perfect appearance and enhanced physical abilities involving his vision, hearing and speed. Do Min-Joon holds a cynical view to human beings, but he falls in love with actress Cheon Song-Yi.",
    "imageUrl": "https://asianwiki.com/images/6/61/You_Who_Came_From_the_Stars-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=57Yc6Z2OiC4",
    "releasedYear": 2014,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Crash Landing On You",
    "synopsis": "Yoon Se-Ri (Son Ye-Jin) is an heiress to a conglomerate in South Korea. One day, while paragliding, an accident caused by strong winds leads Yoon Se-Ri to make an emergency landing in North Korea. There, she meets Ri Jeong-Hyeok (Hyun-Bin), who is a North Korean army officer. He tries to protect her and hide her. Soon, Ri Jeong-Hyeok falls in love with Yoon Se-Ri.",
    "imageUrl": "https://asianwiki.com/images/f/f8/Crash_Landing_on_You-P1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=GVQGWgeVc4k",
    "releasedYear": 2019,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Strong Woman Do Bong Soon",
    "synopsis": "Bong-Soon (Park Bo-Young) was born with superhuman like strength. Her strength is hereditary and passed along only to the women in her family. Her dream is to create a video game with herself as the main character. One day, Bong-Soon helps out a bus driver who is being attacked by a thug. Soon, a small mob of thugs attack Bong-Soon, but she is easily able to wipe the floor with them. During this time, Min-Hyuk (Park Hyung-Sik) drives up to the scene of Bong-Soon beating up the group of thugs. Min-Hyuk is the CEO of video gaming company Ainsoft. He has recently received anonymous threats and even followed by an unknown person. Min-Hyuk believes Bong-Soon would make a great bodyguard with her amazing strength. Besides offering Bong-Soon high pay, he even offers her the chance of working in the planning department of his gaming company if she does well.",
    "imageUrl": "https://asianwiki.com/images/f/f4/Strong_Woman_Do_Bong-Soon-p2.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=SRiEzaSdDZ0",
    "releasedYear": 2017,
    "totalWatchlist": 0,
    "CategoryId": 2
  },
  {
    "title": "Fight For My Way",
    "synopsis": "Drama tells the story of Ko Dong-Man and Choi Ae-Ra. In their school days, Ko Dong-Man took part in taekwondo. Now, he makes a living by working as a contract employee and also goes after the UFC title. Choi Ae-Ra hoped to become an announcer, but she gave up her dream. Now, she works at the information desk of a department store.",
    "imageUrl": "https://asianwiki.com/images/b/b9/Fight_for_My_Way-p02.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=tbRDt_yzwBA",
    "releasedYear": 2017,
    "totalWatchlist": 0,
    "CategoryId": 2
  },
  {
    "title": "Weightlifting Fairy Kim Bok-Joo",
    "synopsis": "Kim Bok-Joo (Lee Sung-Kyung) is a promising collegiate female weightlifter. Her father runs a small chicken restaurant and her uncle wants to become an actor. She has a bright personality and strong sense of justice. Kim Bok-Joo and her friends on the female weightlifting team are not popular with the guys and they don't have boyfriends. The weightlifting team and the rhythmic gymnastic team also don't get along at all. Meanwhile, Jung Joon-Hyung (Nam Joo-Hyuk) is a collegiate swimmer plagued with numerous false start disqualifications. He is 21-years-old and has a free spirit. His uncle and aunt raised him along with his cousin Jung Jae-Yi (Lee Jae-Yoon).",
    "imageUrl": "https://asianwiki.com/images/8/83/Weightlifting_Fairy_Kim_Bok-Joo-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=6t5dLenA85Y",
    "releasedYear": 2016,
    "totalWatchlist": 0,
    "CategoryId": 2
  },
  {
    "title": "Welcome to Waikiki",
    "synopsis": "Kang Dong-Goo (Kim Jung-Hyun) dreams of becoming a movie director, but he is cynical due to bad luck. Cheon Joon-Ki (Lee Yi-Kyung) wanted to follow in his father's footsteps and become an actor, but he is now just a minor actor. Bong-Doo-Sik (Son Seung-Won) came to Seoul to become a scenario writer, but things have not been easy for him. These 3 men run the guest house Waikiki in Itaewon, South Korea. Their guest house is facing bankruptcy and then a mysterious baby and single mother appear at Waikiki.",
    "imageUrl": "https://asianwiki.com/images/b/bc/Eulachacha_Waikiki-P3.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=AJ_eVJp-IuQ",
    "releasedYear": 2018,
    "totalWatchlist": 0,
    "CategoryId": 2
  },
  {
    "title": "What's Wrong With Secretary Kim",
    "synopsis": "Lee Young-Joon's family runs a large company and he works as the vice-president of the company. He is smart, rich and handsome, but he is arrogant. His secretary is Kim Mi-So. She has worked for him for years and she is perfect for him, but Kim Mi-So decides to quit her job.",
    "imageUrl": "https://asianwiki.com/images/2/2f/What%27s_Wrong_With_Secretary_Kim-P1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=e43gG2nC8Cg",
    "releasedYear": 2018,
    "totalWatchlist": 0,
    "CategoryId": 2
  },
  {
    "title": "Vagabond",
    "synopsis": "Cha Dal-Geon (Lee Seung-Gi) is a stunt man who dreams of becoming a world famous action actor. His career is floundering, while he tries to take care of his nephew as his guardian. His nephew takes a flight from Incheon to Morocco for a taekwondo exhibition, but the flight crashes. In Morocco, Cha Dal-Geon sees someone in public that was a passenger on the fatal flight. He becomes convinced that someone or some group sabotaged his nephew's flight. Go Hae-Ri (Bae Suzy) is an NIS agent and is currently working undercover at the Korean embassy in Morocco. She is tasked by the embassy to help the bereaved families from the fatal flight. Cha Dal-Geon turns to Go Hae-Ri for help in finding the man he saw in Morocco who was a passenger on the flight. Soon, Cha Dal-Geon and Go Hae-Ri uncover a far darker and more sinister conspiracy than they expected.",
    "imageUrl": "https://asianwiki.com/images/f/f9/Vagabond_%28Korean_Drama%29-P1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=Kln4ByBiq-o",
    "releasedYear": 2019,
    "totalWatchlist": 0,
    "CategoryId": 3
  },
  {
    "title": "City Hunter",
    "synopsis": "Lee Yoon-Sung (Lee Min-Ho) works at the Blue House for the National Communication Network Team. He graduated from M.I.T. in the U.S. and possesses elite skills as an I.T. engineer. At the Blue House, Yoon-Sung meets Kim Na-Na (Park Min-Young), who works as a bodyguard there. The two people fall for each other even though Yoon-Sung was warned not to fall in love. An elaborate plan for revenge is his ultimate mission.",
    "imageUrl": "https://asianwiki.com/images/b/b5/City_HunterC-p2.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=VgpWsolQGA0",
    "releasedYear": 2011,
    "totalWatchlist": 0,
    "CategoryId": 3
  },
  {
    "title": "The K2",
    "synopsis": "Kim Je-Ha (Ji Chang-Wook) is former solider for hire. He is also called K2. He is hired as a bodyguard by Choi Yoo-Jin (Song Yoon-A). Choi Yoo-Jin is the wife of a presidential candidate (Cho Seong-Ha) and the daughter from a chaebol family. Meanwhile, Ko An-Na (Lim Yoon-A) is the secret daughter of the presidential hopeful. She is also a recluse.",
    "imageUrl": "https://asianwiki.com/images/f/ff/The_K2-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=3EULVjxQi1M",
    "releasedYear": 2016,
    "totalWatchlist": 0,
    "CategoryId": 3
  },
  {
    "title": "Vincenzo",
    "synopsis": "At the age of 8, Park Joo-Hyeong went to Italy after he was adopted. He is now an adult and has the name of Vincenzo Cassano (Song Joong-Ki). He is a lawyer, who works for the Mafia as a consigliere. Because of a war between mafia groups, he flees to South Korea. In South Korea, he gets involved with Lawyer Hong Cha-Young (Jeon Yeo-Bin). She is the type of attorney who will do anything to win a case. Vincenzo Cassano falls in love with her. He also achieves social justice by his own way.",
    "imageUrl": "https://asianwiki.com/images/0/01/Vincenzo-KD-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=S12-4mXCNj4",
    "releasedYear": 2021,
    "totalWatchlist": 0,
    "CategoryId": 3
  },
  {
    "title": "Squid Game",
    "synopsis": "Seong Gi-Hun (Lee Jung-Jae) gets fired from his job. His life is miserable. Seong Gi-Hun hears about a secret survival game, with a 45.6 billion won prize for the winner. He decides to take part in the game. Meanwhile, Cho Sang-Woo (Park Hae-Soo) is like a brother to Seong Gi-Hun and vice versa. They grew up in the same neighborhood. Despite his poor family background, Cho Sang-Woo graduated from a prestigious university and found a good job. He now faces a crisis, due to misappropriation of company funds. He decides to take part in the secret survival game with Seong Gi-Hun.",
    "imageUrl": "https://asianwiki.com/images/0/0e/Squid_Game-p2.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=oqxAJKy0ii4",
    "releasedYear": 2021,
    "totalWatchlist": 0,
    "CategoryId": 3
  },
  {
    "title": "Descendants of the Sun",
    "synopsis": "Shi-Jin (Song Joong-Ki) is the captain of the special forces. He catches a motorcycle thief with Sergeant Major Dae-Young (Jin Goo). The thief is injured during his capture and is sent to the hospital. Dae-Young realises his cellphone was stolen by the thief and goes to the hospital to retrieve his cellphone. In the emergency room, Shi-Jin meets Dr. Mo-Yeon (Song Hye-Kyo) for the first time. He falls in love with her immediately. Mo-Yeon mistakenly assumes Shi-Jin is part of thief's criminal gang. He proves to her that he is a soldier with the help of army doctor Myeong-Joo (Kim Ji-Won).",
    "imageUrl": "https://asianwiki.com/images/e/e3/Descendants_of_the_Sun-p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=wkHjOTFv60g",
    "releasedYear": 2016,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Goblin",
    "synopsis": "In ancient times, Kim Shin (Gong Yoo) is an unbeatable general in wars, but the young King (Kim Min-Jae) is jealous of Kim Shin and kills him. Kim Shin becomes Dokkaebi (Goblin), possessing an immortal life. At first he thinks that he is blessed, but he realizes that he is cursed. Closer to the present day, Kim Shin has waited 900 years for a human bride to end his immortal life. One night, he saves a dying pregnant woman (Park Hee-Von) who is destined to die. Meanwhile, the Grim Reaper (Lee Dong-Wook) is unable to find the dead pregnant woman. The woman gives birth to a baby girl named Ji Eun-Tak (later played by Kim Go-Eun). 9 years later, Ji Eun-Tak lives with her mother and is able to see ghosts. One night, her mother suddenly dies. On that night, she meets the Grim Reaper.",
    "imageUrl": "https://asianwiki.com/images/b/b2/Goblin-p04.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=S94ukM8C17A",
    "releasedYear": 2016,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "While You Were Sleeping",
    "synopsis": "Hong-Joo (Bae Suzy) lives with her mother and helps her run a pork restaurant. Hong-Joo is haunted by seeing the future deaths of others in her dreams. What's worse is that she does not know when the deaths will happen, but she tries to stop her dreams from becoming reality. One night, Hong-Joo dreams about the death of her own mother. Meanwhile, Jae-Chan (Lee Jong-Suk) is a rookie prosecutor. He meets Yoo-Beom (Lee Sang-Yeob) at the prosecutors’ office. Yoo-Beom was Jae-Chan’s private tutor when Jae-Chan was a student, but an incident caused Jae-Chan to dislike him. Yoo-Beom was a prosecutor, but he now works as a lawyer. He takes on any case that brings him money.",
    "imageUrl": "https://asianwiki.com/images/1/1f/While_You_Were_Sleeping-CP1-2.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=8_rEZV3n3mk",
    "releasedYear": 2017,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Itaewon Class",
    "synopsis": "On the first day of attending his new high school, Park Sae-Ro-Yi (Park Seo-Joon) punches his classmate Jang Geun-Won, who was bullying another classmate. The bully is the son of CEO Jang Dae-Hee (Yoo Jae-Myung). The bully's father runs restaurant business Jagga where Park Sae-Ro-Yi’s own father works. CEO Jang Dae-Hee demands to Park Sae-Ro-Yi that he apologizes to his son, but Park Sae-Ro-Yi refuses. Because of his refusal, Park Sae-Ro-Yi gets expelled from school and his father gets fired from his job. Soon, an accident takes place. Park Sae-Ro-Yi’s father dies in a motorcycle accident caused by his ex-classmate Jang Geun-Won. Burning with anger, Park Sae-Ro-Yi viciously beats Jang Geun-Won. He is soon arrested and receives prison time for the violent assault. Park Sae-Ro-Yi decides to destroy the Jagga company and take revenge upon CEO Jang Dae-Hee and his son Jang Geun-Won. Once Park Sae-Ro-Yi is released from prison, he opens a restaurant in Itaewon, Seoul. Jo Yi-Seo (Kim Da-Mi), who is popular on social media, joins Park Sae-Ro-Yi’s restaurant and works there as a manger. She has feelings for Park Sae-Ro-Yi.",
    "imageUrl": "https://asianwiki.com/images/c/c8/Itaewon_Class-mp1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=NeaHNQJ1kCo",
    "releasedYear": 2020,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Love Alarm",
    "synopsis": "Cellphone app Joalarm is created. If someone likes you and they are within 10 meters of you, the alarm for the app rings. The app also shows how many people like you, but the app doesn't reveal specific details on who likes you. Kim Jo-Jo (Kim So-Hyun) is a high school student. She is pretty and smart. She seems like cheerful person, but her parents died when she was young. Since the death of her parents, Kim Jo-Jo has lived with aunt's family. Living there is not easy for Kim Jo-Jo. She doesn't download the app Joalarm.",
    "imageUrl": "https://asianwiki.com/images/3/3c/Love_Alarm-Netflix-P1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=8sXTfzaLmiQ",
    "releasedYear": 2019,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Moon Lovers: Scarlet Heart Ryeo",
    "synopsis": "When a total eclipse of the sun takes place, Hae-Soo (IU) travels back in time to the Goryeo era. There, she falls in love with Wang So (Lee Joon-Gi) who makes other people tremble with fear.",
    "imageUrl": "https://asianwiki.com/images/a/ab/Moon_Lovers.p1.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=2ljxyaAIphc",
    "releasedYear": 2016,
    "totalWatchlist": 0,
    "CategoryId": 1
  },
  {
    "title": "Snowdrop",
    "synopsis": "Graduate student Lim Soo-Ho (Jung Hae-In) is covered in blood and he jumps into the female dormitory at Hosu Women’s University. Eun Yeong-Ro (Kim Ji-Soo) finds him and helps to hide him. They develop a romantic relationship. Lim Soo-Ho is graduate student at a prestigious university. He is Korean-German. He has charisma and he is also mysterious. Eun Yeong-Ro is in the first grade of Hosu Women’s University. She is a major in English literature. She first met Im Soo-Ho on a blind date and fell in love with him at first sight.",
    "imageUrl": "https://asianwiki.com/images/f/fb/Snowdrop_Korean_Drama-p2.jpg",
    "videoUrl": "https://www.youtube.com/watch?v=6CD_ndTXqSQ",
    "releasedYear": 2021,
    "totalWatchlist": 0,
    "CategoryId": 1
  }
]
